Fixed README scematics
